app/Controllers/Auth.php

	public function index()
	{
		$UserModel = new \App\Models\UserModel();
		$auth = $this->request->getPOst('auth');
		if($auth){
		   $username = $this->request->getPost('username');
		   $password = $this->request->getPost('password');

		   if($username == '' or $password == ''){
		   	$err = "Silahkan Masukkan Username dan Password";
		   }
		   if(empty($err)){
		   		$datauser = $UserModel->where("username", $username)->first();
---
SELECT *
FROM `user`
WHERE `username` = 'rezaintanaulya'
 LIMIT 1